<?php // CODE BY HW
namespace KKdayB2BApi;

class CommonDict
{
    /**
     * 品类标签
     */
    public static $tags = [
        'TAG_1'   => '水族館 & 動物園',
        'TAG_1_1' => '刺激冒險',
        'TAG_1_2' => '水上活動',
        'TAG_1_3' => '戶外休閒',
        'TAG_2'   => '歷史景點',
        'TAG_2_1' => '景點門票',
        'TAG_2_2' => '博物館 & 美術館',
        'TAG_2_3' => '主題樂園',
        'TAG_2_4' => '運動賽事',
        'TAG_2_5' => '餐廳美食',
        'TAG_2_6' => '娛樂門票',
        'TAG_3'   => '展覽',
        'TAG_3_1' => '特色行程',
        'TAG_3_2' => '甜點飲品',
        'TAG_3_3' => 'spa & 按摩',
        'TAG_3_4' => '工作坊＆課程',
        'TAG_3_5' => '逛街購物',
        'TAG_3_6' => '文化節慶',
        'TAG_3_7' => '伴手禮',
        'TAG_4'   => '雪地活動',
        'TAG_4_1' => '城市觀光',
        'TAG_4_2' => '文史藝術',
        'TAG_4_3' => '自然生態',
        'TAG_4_4' => '半/一日遊',
        'TAG_4_5' => '多日遊',
        'TAG_4_6' => '專車服務',
        'TAG_4_7' => '郵輪假期',
        'TAG_4_8' => '專業攝影服務',
        'TAG_5'   => '遠足 & 登山',
        'TAG_5_1' => '交通票券',
        'TAG_5_2' => '機場接駁',
        'TAG_5_3' => '租車自駕',
        'TAG_5_4' => '遊船觀光',
        'TAG_5_5' => 'WiFi & SIM卡',
        'TAG_6'   => '觀光農場',
        'TAG_6_1' => '飯店',
        'TAG_6_2' => '民宿',
        'TAG_6_3' => '住宿券',
        'TAG_6_4' => '露營',
        'TAG_6_5' => '環島之星',
        'TAG_6_6' => '高鐵假期',
        'TAG_6_8' => '華信假期',
        'TAG_7'   => '美容 & 沙龍',
        'TAG_8'   => '溫泉',
        'TAG_9'   => '文化體驗',
        'TAG_10'  => '手作材料包',
        'TAG_11'  => '線上旅遊',
        'TAG_12'  => '單車旅遊',
        'TAG_13'  => '生鮮雜貨',
        'TAG_14'  => '度假村',
        'TAG_15'  => '旅遊文件申請服務',
        'TAG_16'  => '行李運送/寄存服務',
        'TAG_17'  => '旅行裝備與相關服務',
        'TAG_18'  => '機+酒',
        'TAG_19'  => '機+行程&門票',
        'TAG_20'  => '機+團體旅遊&Mini Tours',
        'TAG_21'  => '機+郵輪假期',
        'TAG_22'  => '機票',
    ];

    /**
     * 获取标签名称
     * @param $name
     * @return string
     */
    public static function getTagName($name): string
    {
        return self::$tags[$name]??'';
    }
}
